public class PrintBinary {
    /*
    * 打印一个数的二进制结果
    * */
    public static void main(String[] args) {
        int num =8;
        printB(num);
    }
    /*
    * 以8为例
    * 1<<i表明将1左移i位，其余以0填充 左移相当于×2
    * i=31时：
    * 00000000000000000000000000001000
    * &
    * 10000000000000000000000000000000
    * ——————————————————————
    * 00000000000000000000000000000000   得到第31为的二进制为0
    * 依次类推，每次在对应的位置与1，得到该位的值
    *
    *
    * 补充知识：
    * 右移有两种
    * 1>>i 右移i位，最高位用符号位来补
    * 1>>>i 右移i位，最高位用0来补
    * 相反数：num = ~num + 1 取反加一
    * */
    public static void printB(int num){
        for (int i = 31; i >=0 ; i--) {
            System.out.print((num & (1<<i)) == 0?"0":"1");
        }
    }
}
